This Query is created by user whiteklay

In [2]:
%%hive_spark
WITH atm_data AS (
    SELECT company_code, CAST(txn_amount AS FLOAT) AS txn_amount, 
           value_date, credit_acct_no, debit_acct_no, name_address
    FROM atm_history_data
)
SELECT atm_data.company_code, atm_data.txn_amount, atm_data.value_date, 
       atm_data.credit_acct_no, atm_data.debit_acct_no, 
       v_f_company.name_address, v_f_company.l_b2_rating_agy, 
       v_f_company.mnemonic, v_f_company.stat_rep_name AS mgmt_rep_area
FROM atm_data
INNER JOIN v_f_company ON atm_data.company_code = v_f_company.company_code;